---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveNumberOfSegments
source: html/919be23e-55ae-4a82-55f8-45877bda573d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveNumberOfSegments Property

"Number of Full Segments"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveNumberOfSegments { get; }
```